import chalk from 'chalk';
import { TARSIUS_VERSION } from '../index.js';

// prints the big ascii logo to the terminl
export function printBanner() {
    const cyan = chalk.cyan;
    const yellow = chalk.yellow;

    console.log(cyan(`
 ████████╗ █████╗ ██████╗ ███████╗██╗██╗   ██╗███████╗
 ╚══██╔══╝██╔══██╗██╔══██╗██╔════╝██║██║   ██║██╔════╝
    ██║   ███████║██████╔╝███████╗██║██║   ██║███████╗
    ██║   ██╔══██║██╔══██╗╚════██║██║██║   ██║╚════██║
    ██║   ██║  ██║██║  ██║███████║██║╚██████╔╝███████║
    ╚═╝   ╚═╝  ╚═╝╚═╝  ╚═╝╚══════╝╚═╝ ╚═════╝ ╚══════╝`));
    console.log(yellow(`[*] Tarsius ${TARSIUS_VERSION} - Black Box Web Scanner`));
}
